app/controllers/items_controller.rb

INSERT INTO "items" ("name", "price", "image_path", "description", "created_at", "updated_at", "pages", "type") VALUES ('Item', '34.00', 'images/image.jpg', 'Here is a description of the Item', '2011-07-26 01:58:57.967914', '2011-07-26 01:58:57.967914', NULL, NULL)
---
  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save