app/controllers/purchases_controller.rb

SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = 1 LIMIT 1
---
  def show
    @purchase = Purchase.find(params[:id])

SELECT "items".* FROM "items" WHERE "items"."id" = 2 LIMIT 1
---
  def new
    @purchase = Purchase.new
    @item = Item.find(params[:item_id])

INSERT INTO "purchases" ("email", "address", "created_at", "updated_at") VALUES ('asdf', 'asdf', '2011-07-27 11:43:41.687424', '2011-07-27 11:43:41.687424')
---
  def create
    @purchase = Purchase.new(params[:purchase])

    respond_to do |format|
      if @purchase.save

SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" = 1 LIMIT 1
DELETE FROM "purchases" WHERE "purchases"."id" = 1
---
  def destroy
    @purchase = Purchase.find(params[:id])
    @purchase.destroy